def area(a, b):
    """
    Вычисляет площадь прямоугольника.
    
    Args:
        a (float): Длина прямоугольника
        b (float): Ширина прямоугольника
        
    Returns:
        float: Площадь прямоугольника
    """
    return a * b


def perimeter(a, b):
    """
    Вычисляет периметр прямоугольника.
    
    Args:
        a (float): Длина прямоугольника
        b (float): Ширина прямоугольника
        
    Returns:
        float: Периметр прямоугольника
    """
    return 2 * (a + b)